Quetzalcoatlus2/Embedded-MSP430FR2355/signal generator.c
// Runtime-generated pulse-train waveform.
unsigned int pulse_train_wave[300];
// Slot-based waveform routing:
// - assignment slot (X/Y/Z) receives waveform type commands
// - output slot (L/M/N) is sent to DAC
unsigned int *waveform_slots[3];
unsigned int current_assignment_slot_index = 0;
unsigned int current_output_slot_index = 0;
// UART format buffer for ADC output lines (one line per ADC channel).
char ADC_char[3][12] = {
    {'A','x','=',' ','x','x','x','x',10,13,0},
    {'A','x','=',' ','x','x','x','x',10,13,0},
    {'A','x','=',' ','x','x','x','x',10,13,0}
};
// Generic loop counters.
unsigned int i,j;
// Current sample index in one waveform period.
unsigned int current_waveform_index = 0;
// Forward declarations.
// Software DCO trim helper to improve clock stability.
void Software_Trim();
void uart_send_string(const char *str);
void uart_send_uint(unsigned int val);
// Reference MCLK value used in clock-trim delay calculations.
#define MCLK_FREQ_MHZ 24
// ADC conversion results (three channels).
unsigned int ADC_Result[3];
// Rolling ADC result index used by ADC ISR.
unsigned char ADC_i;
// Legacy DAC variable (final DAC write is done in Timer2_B0_ISR).
unsigned int DAC_data=0;
// Frequency input parser state.
#define FREQ_INPUT_BUFFER_SIZE 6
char freq_input_buffer[FREQ_INPUT_BUFFER_SIZE];
unsigned char freq_input_buffer_idx = 0;
// Amplitude input parser state.
#define AMPLITUDE_INPUT_BUFFER_SIZE 4
char amplitude_input_buffer[AMPLITUDE_INPUT_BUFFER_SIZE];
unsigned char amplitude_input_buffer_idx = 0;
unsigned int current_amplitude_percentage = 100;
// Precomputed amplitude scaling used in ISR:
// scaling = (amplitude_percent * 256) / 100
volatile unsigned int current_amplitude_scaling_factor;
// Offset input parser state.
#define OFFSET_INPUT_BUFFER_SIZE 5
char offset_input_buffer[OFFSET_INPUT_BUFFER_SIZE];
unsigned char offset_input_buffer_idx = 0;
unsigned int current_offset_mv = 1650;
// Precomputed DC offset in DAC units:
// offset_dac = (offset_mv * 4095) / 3300
volatile long precalculated_offset_dac_units;
// Phase input parser state.
#define PHASE_INPUT_BUFFER_SIZE 4
char phase_input_buffer[PHASE_INPUT_BUFFER_SIZE];
unsigned char phase_input_buffer_idx = 0;
unsigned int current_phase_offset_samples = 0;
// UART receive state machine:
// command mode or one of numeric-input modes (F/A/O/H).
typedef enum {
    NORMAL_COMMAND_MODE,
    FREQUENCY_INPUT_MODE,
    AMPLITUDE_INPUT_MODE,
    OFFSET_INPUT_MODE,
    PHASE_INPUT_MODE
} UART_RX_State;
// Current UART receive state.
UART_RX_State uart_rx_state = NORMAL_COMMAND_MODE;
// Timer increment controlling waveform sample rate:
// frequency ≈ SMCLK / (timer_b0_ccr0_increment * 300).
volatile unsigned int timer_b0_ccr0_increment = 666;



int main(void)
{
    // Stop watchdog timer during initialization.



    WDTCTL = WDTPW | WDTHOLD;




    // Build square waveform: 50% duty cycle.
    for(i=0; i<300; i++)
    {
        if(i < 150) square_wave[i] = 4095;
        else square_wave[i] = 0;
    }




    // Build pulse-train waveform: narrow pulse.
    for(i=0; i<300; i++)
    {
        if(i < 3) pulse_train_wave[i] = 4095;
        else pulse_train_wave[i] = 0;
    }



    // Initialize waveform slots with sine by default.
    waveform_slots[0] = sine_wave;
    waveform_slots[1] = sine_wave;
    waveform_slots[2] = sine_wave;


    // Initialize default signal parameters.
    current_amplitude_percentage = 100;

    current_amplitude_scaling_factor = ((long)current_amplitude_percentage * 256) / 100;
    current_offset_mv = 1650;

    precalculated_offset_dac_units = ((long)current_offset_mv * 4095L) / 3300L;
    current_phase_offset_samples = 0;




    // Configure flash wait states and clock system for 24 MHz operation.
    FRCTL0 = FRCTLPW | NWAITS_2;



    __bis_SR_register(SCG0);

    CSCTL3 = SELREF__REFOCLK;



    // DCO range selection + fine trim enabled.
    CSCTL1 = DCOFTRIMEN_1 | DCOFTRIM0 | DCOFTRIM1 | DCORSEL_6;




    // FLL multiplier for ~24 MHz target.
    CSCTL2 = FLLD_0 + 731;

    __delay_cycles(3);

    __bic_SR_register(SCG0);

    // Final software trim for stable DCO.
    Software_Trim();



    CSCTL4 = SELMS__DCOCLKDIV | SELA__REFOCLK;


    current_waveform_index = 0;





    // GPIO function mux configuration.
    P1SEL0 |= BIT5;
    P1SEL1 |= BIT5;



    P4SEL0 |= BIT2 | BIT3;
    P4SEL1 &=~(BIT2 | BIT3);



    // UART configuration for command interface.
    UCA1CTLW0 |= UCSWRST;

    UCA1CTLW0 |= UCSSEL_2;



    // Baud-rate divider for 115200 with 24 MHz SMCLK.
    UCA1BR0 = 13;
    UCA1BR1 = 0x00;




    // Fractional modulation settings.
    UCA1MCTLW = (0x44 << 8) | (0 << 4) | UCOS16;



    // SAC output pins.
    P3DIR |= BIT0; P3SEL0 |= BIT0; P3SEL1 &= ~BIT0;

    P3DIR |= BIT4; P3SEL0 |= BIT4; P3SEL1 &= ~BIT4;



    // ADC analog input pins (A0/A1/A2).
    P1SEL0 |=  BIT0 + BIT1 + BIT2;
    P1SEL1 |=  BIT0 + BIT1 + BIT2;



    // Unlock GPIOs from high-impedance mode.
    PM5CTL0 &= ~LOCKLPM5;




    // Enable internal voltage reference.
    PMMCTL0_H = PMMPW_H;
    PMMCTL2 |= INTREFEN;

    __delay_cycles(400);


    // Enable UART and print startup help.
    UCA1CTLW0 &= ~UCSWRST;


    uart_send_string("\r\n--- MSP430 Waveform Generator ---\r\n");
    uart_send_string("Waveform assignment (applies to the selected assignment slot):\r\n");
    uart_send_string(" s : Sine\r\n t : Triangle\r\n r : Ramp\r\n p : Square\r\n c : Pulse\r\n");
    uart_send_string("Select assignment slot:\r\n X:Slot 0, Y:Slot 1, Z:Slot 2\r\n");
    uart_send_string("Select DAC output slot:\r\n L:Slot 0, M:Slot 1, N:Slot 2\r\n");
    uart_send_string("Other commands:\r\n");
    uart_send_string(" F : Set Frequency (1-10000 Hz)\r\n");
    uart_send_string(" A : Set Amplitude (0-100 %)\r\n");
    uart_send_string(" O : Set Offset (0-3300 mV)\r\n");
    uart_send_string(" H : Set Phase (0-299 samples)\r\n");
    uart_send_string(" # : Send ADC Data\r\n");
    uart_send_string("current: Slot 0->0, Freq ~100Hz, Ampl 100%, Offset 1650mV, Phase 0.\r\n");
    uart_send_string("> ");



    // Enable UART RX interrupt.
    UCA1IE |= UCRXIE;




