Quetzalcoatlus2/Embedded-MSP430FR2355/signal generator.c
    // ADC basic configuration.
    ADCCTL0 |= ADCSHT_10 | ADCON;



    ADCCTL1 |= ADCSHP | ADCSHS_2 | ADCCONSEQ_3;


    // Set ADC resolution to 12 bits.
    ADCCTL2 &= ~ADCRES;
    ADCCTL2 |= ADCRES_2;



    ADCMCTL0 |= ADCINCH_2;

    ADCIE |= ADCIE0;





    // SAC1 setup for DAC output path.
    SAC1DAC = DACSREF_0 + DACLSEL_0 + DACIE;

    SAC1DAT = DAC_data;

    SAC1DAC |= DACEN;






    SAC1OA = NMUXEN + PMUXEN + PSEL_1 + NSEL_1;
    SAC1OA |= OAPM_0;


    SAC1PGA = MSEL_1;


    SAC1OA |= SACEN + OAEN;




    TB2CCR0 = timer_b0_ccr0_increment;

    TB2CCR1 = 10;

    TB2CCTL0 = CCIE;

    TB2CCTL1 = CCIE;







    // Timer_B2 drives DAC sample update cadence.
    TB2CTL |= TBSSEL__SMCLK | ID_0 | TBCLR | MC__CONTINOUS| TBIE;




    // Timer_B1 provides ADC trigger cadence.
    TB1CCR0 = 326;



    TB1CCTL1 = OUTMOD_7;

    TB1CCR1 = 163;




    TB1CTL = TBSSEL__ACLK | MC__UP | TBCLR;


    ADC_i = 2;

    i=0;


    // Enable ADC conversions and global interrupts.
    ADCCTL0 |= ADCENC;

    TB1CTL |= TBCLR;



    __bis_SR_register(GIE);



    // Runtime behavior is interrupt-driven after init.
    __no_operation();
}


// Send a null-terminated UART string.
void uart_send_string(const char *str)
{

    while (*str)
    {


        while (!(UCA1IFG & UCTXIFG));

        UCA1TXBUF = *str++;
    }


    while (UCA1STATW & UCBUSY);
}



// Send an unsigned integer over UART as decimal text.
void uart_send_uint(unsigned int val) {
    char buffer[6];
    int k = 0;


    if (val == 0) {
        while(!(UCA1IFG&UCTXIFG)); UCA1TXBUF = '0';
        return;
    }

    unsigned int temp = val;

    do {
        buffer[k++] = (temp % 10) + '0';
        temp /= 10;
    } while (temp > 0 && k < 5);


    while (k > 0) {
        while(!(UCA1IFG&UCTXIFG)); UCA1TXBUF = buffer[--k];
    }
}



#if defined(__TI_COMPILER_VERSION__) || defined(__IAR_SYSTEMS_ICC__)
// ADC interrupt service routine.
#pragma vector=ADC_VECTOR
__interrupt void ADC_ISR(void)
#elif defined(__GNUC__)
void __attribute__ ((interrupt(ADC_VECTOR))) ADC_ISR (void)
#else
#error Compiler not supported!
#endif
{


    switch(__even_in_range(ADCIV,ADCIV_ADCIFG))
    {
        case ADCIV_NONE:
            break;
        case ADCIV_ADCOVIFG:
            break;
        case ADCIV_ADCTOVIFG:
            break;
        case ADCIV_ADCHIIFG:
            break;
        case ADCIV_ADCLOIFG:
            break;
        case ADCIV_ADCINIFG:
            break;
        case ADCIV_ADCIFG:

            ADC_Result[ADC_i] = ADCMEM0;





            if(ADC_i == 0)
            {
                __no_operation();
                ADC_i = 2;
            }
            else
            {
                ADC_i--;
            }
            break;
        default:
            break;
    }
}




#if defined(__TI_COMPILER_VERSION__) || defined(__IAR_SYSTEMS_ICC__)
// UART interrupt service routine (command parser + echo).
#pragma vector=USCI_A1_VECTOR
__interrupt void USCI_A1_ISR(void)
#elif defined(__GNUC__)
void __attribute__ ((interrupt(USCI_A1_VECTOR))) USCI_A1_ISR(void)
#else
#error Compiler not supported!
#endif
{
  char received_char;


  // Dispatch UART interrupt source.
  switch(__even_in_range(UCA1IV,USCI_UART_UCTXCPTIFG))
  {
    case USCI_NONE: break;
    case USCI_UART_UCRXIFG:
        // Read RX byte and echo it back to the terminal.
        received_char = UCA1RXBUF;


        while(!(UCA1IFG&UCTXIFG));
        UCA1TXBUF = received_char;


        // Parse input according to active UART state-machine mode.
        if (uart_rx_state == FREQUENCY_INPUT_MODE)
        {
            if (received_char == '\r' || received_char == '\n')
            {
                uart_send_string("\r\n");
                if (freq_input_buffer_idx > 0)
                {
                    freq_input_buffer[freq_input_buffer_idx] = '\0';
                    unsigned long requested_freq_hz = atoi(freq_input_buffer);


                    // Validate requested frequency range.
                    if (requested_freq_hz >= 1 && requested_freq_hz <= 10000)
                    {
                        unsigned long calc_increment;



                        // Compute timer increment from requested frequency and samples/period.
                        calc_increment = 24000000UL / requested_freq_hz;
                        calc_increment /= 300UL;


                        // Clamp timer increment to practical hardware limits.
                        const unsigned int MIN_CCR_INCREMENT = 7;
                        const unsigned int MAX_CCR_INCREMENT = 65535;

                        if (calc_increment < MIN_CCR_INCREMENT) {
                            timer_b0_ccr0_increment = MIN_CCR_INCREMENT;
                        } else if (calc_increment > MAX_CCR_INCREMENT) {
                            timer_b0_ccr0_increment = MAX_CCR_INCREMENT;
                        } else {
                            timer_b0_ccr0_increment = (unsigned int)calc_increment;
                        }



                        // Report effective output frequency achieved by the quantized increment.
                        unsigned long term_calc = (24000000UL / 300UL) * 1000UL;
                        unsigned long actual_freq_milihz = term_calc / (unsigned long)timer_b0_ccr0_increment;

                        unsigned int actual_hz = actual_freq_milihz / 1000;
                        unsigned int actual_tenths = (actual_freq_milihz % 1000) / 100;

                        uart_send_string("Target: "); uart_send_uint(requested_freq_hz); uart_send_string("Hz. ");
                        uart_send_string("Actual: "); uart_send_uint(actual_hz); uart_send_string("."); uart_send_uint(actual_tenths);
                        uart_send_string("Hz (CCR Inc: "); uart_send_uint(timer_b0_ccr0_increment); uart_send_string(")\r\n> ");
                    }
                    else
                    {

                        uart_send_string("Invalid frequency. Valid range: 1-10000 Hz.\r\nEffective range approx 1-11428 Hz.\r\n> ");
                    }
                } else {
                     uart_send_string("No frequency was entered.\r\n> ");
                }
                uart_rx_state = NORMAL_COMMAND_MODE;
                freq_input_buffer_idx = 0;
                memset(freq_input_buffer, 0, FREQ_INPUT_BUFFER_SIZE);
            }

            // Accept numeric input while there is room in the buffer.
            else if (received_char >= '0' && received_char <= '9' && freq_input_buffer_idx < (FREQ_INPUT_BUFFER_SIZE - 1))
            {
                freq_input_buffer[freq_input_buffer_idx++] = received_char;
            }

            // Handle backspace for interactive terminal editing.
            else if ((received_char == '\b' || received_char == 127) && freq_input_buffer_idx > 0)
            {
                freq_input_buffer_idx--;
                uart_send_string(" \b");
            }
        }
        else if (uart_rx_state == AMPLITUDE_INPUT_MODE)
        {
            if (received_char == '\r' || received_char == '\n')
            {
                uart_send_string("\r\n");
                if (amplitude_input_buffer_idx > 0)
                {
                    amplitude_input_buffer[amplitude_input_buffer_idx] = '\0';
                    int requested_amplitude = atoi(amplitude_input_buffer);


                    if (requested_amplitude >= 0 && requested_amplitude <= 100)
                    {
                        current_amplitude_percentage = (unsigned int)requested_amplitude;

                        current_amplitude_scaling_factor = ((long)current_amplitude_percentage * 256) / 100;
                        uart_send_string("Amplitude set to: ");
                        uart_send_uint(current_amplitude_percentage);
                        uart_send_string(" %\r\n> ");
                    }
                    else
                    {
                        uart_send_string("Invalid amplitude. Enter a value between 0-100 %.\r\n> ");
                    }
                } else {
                     uart_send_string("No amplitude was entered.\r\n> ");
                }
                uart_rx_state = NORMAL_COMMAND_MODE;
                amplitude_input_buffer_idx = 0;
                memset(amplitude_input_buffer, 0, AMPLITUDE_INPUT_BUFFER_SIZE);
            }

            else if (received_char >= '0' && received_char <= '9' && amplitude_input_buffer_idx < (AMPLITUDE_INPUT_BUFFER_SIZE - 1))
            {
                amplitude_input_buffer[amplitude_input_buffer_idx++] = received_char;
            }

            else if ((received_char == '\b' || received_char == 127) && amplitude_input_buffer_idx > 0)
            {
                amplitude_input_buffer_idx--;
                uart_send_string(" \b");
            }
        }
        else if (uart_rx_state == OFFSET_INPUT_MODE)
        {
            if (received_char == '\r' || received_char == '\n')
            {
                uart_send_string("\r\n");
                if (offset_input_buffer_idx > 0)
                {
                    offset_input_buffer[offset_input_buffer_idx] = '\0';

