Quetzalcoatlus2/Embedded-MSP430FR2355/signal generator.c
    // Apply phase offset in sample domain.
    unsigned int temp_phased_index = current_waveform_index + current_phase_offset_samples;
    if (temp_phased_index >= 300) {
        temp_phased_index -= 300;
    }
    unsigned int phased_waveform_index = temp_phased_index;



    // Fetch raw waveform sample from selected output slot.
    unsigned int raw_sample = waveform_slots[current_output_slot_index][phased_waveform_index];


    long dac_raw_midpoint = 2048;




    // Center sample around midpoint, scale by amplitude, then add DC offset.
    long sample_relative_to_raw_mid = (long)raw_sample - dac_raw_midpoint;






    long scaled_relative_sample = (sample_relative_to_raw_mid * current_amplitude_scaling_factor) >> 8;


    long offset_dac_units = precalculated_offset_dac_units;



    long final_value_long = offset_dac_units + scaled_relative_sample;


    // Clamp to valid 12-bit DAC range.
    if (final_value_long < 0) final_value_long = 0;
    if (final_value_long > 4095) final_value_long = 4095;



    // Write final sample to DAC data register.
    SAC1DAT = (unsigned int)final_value_long;
}



#if defined(__TI_COMPILER_VERSION__) || defined(__IAR_SYSTEMS_ICC__)
// Timer B2 CCR1/overflow ISR.
#pragma vector = TIMER2_B1_VECTOR
__interrupt void Timer2_B1_ISR(void)
#elif defined(__GNUC__)
void __attribute__ ((interrupt(TIMER2_B1_VECTOR))) Timer2_B1_ISR (void)
#else
#error Compiler not supported!
#endif
{

    switch(TB2IV)
    {
        case TBIV__NONE:
            break;
        case TBIV__TBCCR1:
            TB2CCR1 += 10;


            break;
        case TBIV__TBIFG:
            break;
        default:
            break;
    }
}
// Software DCO trim helper to improve clock stability.
void Software_Trim()
{

    unsigned int oldDcoTap = 0xffff;
    unsigned int newDcoTap = 0xffff;
    unsigned int newDcoDelta = 0xffff;
    unsigned int bestDcoDelta = 0xffff;
    unsigned int csCtl0Copy = 0;
    unsigned int csCtl1Copy = 0;
    unsigned int csCtl0Read = 0;
    unsigned int csCtl1Read = 0;
    unsigned int dcoFreqTrim = 3;
    unsigned char endLoop = 0;

    // Iteratively adjust trim until DCO tap converges around midpoint.
    do
    {

        // Reset DCO tap to midscale before each measurement cycle.
        CSCTL0 = 0x100;
        do
        {


            CSCTL7 &= ~DCOFFG;
        }while (CSCTL7 & DCOFFG);



        // Wait long enough for FLL/DCO to settle.
        __delay_cycles((unsigned int)3000 * MCLK_FREQ_MHZ);



        while((CSCTL7 & (FLLUNLOCK0 | FLLUNLOCK1)) && ((CSCTL7 & DCOFFG) == 0));


        csCtl0Read = CSCTL0;
        csCtl1Read = CSCTL1;

        oldDcoTap = newDcoTap;
        newDcoTap = csCtl0Read & 0x01ff;
        dcoFreqTrim = (csCtl1Read & 0x0070)>>4;



        // Adjust DCOFTRIM direction based on whether tap is below/above center.
        if(newDcoTap < 256)
        {
            newDcoDelta = 256 - newDcoTap;

            if((oldDcoTap != 0xffff) && (oldDcoTap >= 256))
                endLoop = 1;
            else
            {
                dcoFreqTrim--;
                CSCTL1 = (csCtl1Read & (~DCOFTRIM)) | (dcoFreqTrim<<4);
            }
        }
        else
        {
            newDcoDelta = newDcoTap - 256;

            if(oldDcoTap < 256)
                endLoop = 1;
            else
            {
                dcoFreqTrim++;
                CSCTL1 = (csCtl1Read & (~DCOFTRIM)) | (dcoFreqTrim<<4);
            }
        }


        if(newDcoDelta < bestDcoDelta)
        {
            csCtl0Copy = csCtl0Read;
            csCtl1Copy = csCtl1Read;
            bestDcoDelta = newDcoDelta;
        }

    }while(endLoop == 0);


    // Restore best register values found during sweep.
    CSCTL0 = csCtl0Copy;
    CSCTL1 = csCtl1Copy;

    while(CSCTL7 & (FLLUNLOCK0 | FLLUNLOCK1));
}
